:PROPERTIES:
:DIR:      /home/bpanthi/lisp/rcc/ml/.data/
:END:
#+TITLE: Recurrent Neural Network - Backpropagation Through Time
#+Author: Bibek Panthi
#+ROAM_REF: https://www.analyticsvidhya.com/blog/2019/01/fundamentals-deep-learning-recurrent-neural-networks-scratch-python/

\newpage
Adopted from [[http://www.wildml.com/2015/09/recurrent-neural-networks-tutorial-part-2-implementing-a-language-model-rnn-with-python-numpy-and-theano/][tutorial]]. 
** Assign index to each word 
#+begin_src lisp :tangle rnn.lisp
  ;; index-to-word & word-to-index
  (defparameter *word-count* (make-hash-table :test #'equal))

  (loop for s in *sentences* do 
    (loop for w in s 
	  for word = (string-downcase w) 
	  for count = (gethash word *word-count* 0) do 
	    (setf (gethash word *word-count*) (1+ count))))
#+end_src

There are 
#+begin_src lisp :exports both
  (hash-table-count *word-count*)
#+end_src

#+RESULTS:
: 3032

unique words. 
** Testing forward-propagation and loss calculation 
#+begin_src lisp :exports both
  (let ((network (make-instance 'network :c 1000 :h 100))
	(*data* (make-array 100 :displaced-to *data*)))
    (calculate-total-loss network
			  (map 'list #'first *data*)
			  (map 'list #'second *data*)))
#+end_src

#+RESULTS:
: 6\.907459817685422d0

 We have C words in our vocabulary, so each word should be (on average) predicted with probability 1/C, which would yield a loss of logC = log1000 = 6.9077554. 

Our value is also quite close, so we are in the right track.

** Test of BPTT  
We can always check backpropagation with an acutal gradient computed using 

\begin{equation*}
\frac{\partial f(x;\theta)} {\partial \theta} = \lim_{h \to 0} \frac {f(x; \theta +h ) - f(x; \theta)} {h}
\end{equation*}

#+begin_src lisp :results output :exports both
  (defun gradient-check (n x y)
    (declare (optimize (debug 3)))
    (with-slots (U V W) n 
      (multiple-value-bind (dL/dU dL/dV dL/dW) (bptt n x y :bptt-truncate 40)
	;; for each variable take a random parameters and check it 
	(let  ((loss (loss (forward-propagate n x) y))
	       (new-loss nil)
	       (diff 0.0001)
	       (actual-derivative nil))
	  (loop repeat 5 do 
	    (loop for derivative-var in (list dL/dU dL/dV dL/dW) 
		  for var in (list U V W)
		  for name in '(U V W)
		  for i = (random (array-dimension var 0))
		  for j = (random (array-dimension var 1)) 
		  for original-value = (aref var i j) do 
		    (format t "~& Checking at ~d,~d of ~s" i j name)
		    (incf (aref var i j) diff)
		    (setf new-loss (loss (forward-propagate n x) y))
		    (setf (aref var i j) original-value
			  actual-derivative (/ (- new-loss loss) diff))
		    (format t "~&   Actual Derivative: ~f" actual-derivative)
		    (format t "~&   Computed Derivative: ~f" (aref derivative-var i j))
		    (unless (= actual-derivative 0.0d0)
		      (when (< (abs (/ (aref derivative-var i j) actual-derivative)) .9)
			(format t "~&[WARNING] Relative Error > 90% !!!")))))))))


  (let ((n (make-instance 'network :c 1000 :h 10)))
    (destructuring-bind (x y) (aref *data* 0)
      (gradient-check n x y)))    
#+end_src

#+RESULTS:
#+begin_example
 Checking at 1,933 of U
   Actual Derivative: 0.0
   Computed Derivative: 0.0
 Checking at 866,6 of V
   Actual Derivative: -0.000019541062595428733
   Computed Derivative: -0.000019541967203488295
 Checking at 0,9 of W
   Actual Derivative: -0.013063465519599794
   Computed Derivative: 0.02276368401665077
 Checking at 2,122 of U
   Actual Derivative: 0.0
   Computed Derivative: 0.0
 Checking at 839,1 of V
   Actual Derivative: 0.0001507862672844925
   Computed Derivative: 0.00015078568191896963
 Checking at 1,0 of W
   Actual Derivative: 0.0007341455629026561
   Computed Derivative: -0.015454469780238055
 Checking at 0,159 of U
   Actual Derivative: 0.0
   Computed Derivative: 0.0
 Checking at 330,9 of V
   Actual Derivative: -0.00010548660878157174
   Computed Derivative: -0.0001054866726425041
 Checking at 7,1 of W
   Actual Derivative: -0.011276178498253225
   Computed Derivative: -0.0033533307913708663
[WARNING] Relative Error > 90% !!!
 Checking at 2,118 of U
   Actual Derivative: 0.0
   Computed Derivative: 0.0
 Checking at 558,3 of V
   Actual Derivative: -0.00008898126904709327
   Computed Derivative: -0.00008898159965005954
 Checking at 6,5 of W
   Actual Derivative: 0.0005569091995027611
   Computed Derivative: -0.015009585574136189
 Checking at 3,381 of U
   Actual Derivative: 0.0
   Computed Derivative: 0.0
 Checking at 922,4 of V
   Actual Derivative: 0.000035769006438858855
   Computed Derivative: 0.00003576841434122246
 Checking at 4,3 of W
   Actual Derivative: 0.014327403128352624
   Computed Derivative: 0.029498057807640476
#+end_example

This shows that our BPTT algorithm has higher probability of being correct. only few check are giving warning. and that can be because of numerical errors/rounding.
* Train!! 
Lets initialize a RNN with a single hidden layer. The input and output layers have 1000 neurons and the hidden layer has 100 neurons. 
#+begin_src dot :file .data/neurons.pdf
  digraph G {
	  rankdir = LR;
	  splines=false;
	  // input layer to hidden layer 
	  x1 -> {  h1 ; h2 ;  "h100"}
	  x2 -> {  h1 ; h2 ;  "h100"}
	  x3 -> {  h1 ; h2 ;  "h100"}
	  "x1000" -> {  h1 ; h2 ; "h100"}

	  { // order in input layer 
		  x1 -> x2 -> x3 -> x1000 [style=invis]
		  {rank = same; x1 ; x2 ; x3; x1000}
	  }
	
	  // hidden layer to output layer 
	  h1 -> {o1 ; o2 ; o3 ;  "o1000"}
	  h2 -> {o1 ; o2 ; o3 ;  "o1000"}
	  "h100" -> {o1 ; o3 ; o2;  "o1000"}

	  // recurrent nurons in hidden layer 
	  {
		  splines = true;
		  h1 -> h1
		  h2 -> h2 
		  h100 -> h100
	  }

	  {  // order in output layer 
		  o1->o2->o3->o1000 [style=invis]
		  {rank = same; o1; o2; o3; o1000}
	  }
  }

#+end_src

#+RESULTS:
[[file:.data/neurons.pdf]]

#+begin_src lisp :results output  :exports both
  (defparameter *network* (make-instance 'network 
					 :c *vocabulary_size*
					 :h 100))
  (train-with-sgd *network* 
		  (subseq (map 'list #'first *data*) 100)
		  (subseq (map 'list #'second *data*) 100))
#+end_src

#+RESULTS: 
#+begin_example
     0 examples learned
     50 examples learned
 Epoch 0 done in 17.47 seconds.
     0 examples learned
     50 examples learned
 Epoch 1 done in 17.55 seconds.
     0 examples learned
     50 examples learned
 Epoch 2 done in 17.46 seconds.
     0 examples learned
     50 examples learned
 Epoch 3 done in 17.480001 seconds.
     0 examples learned
     50 examples learned
 Epoch 4 done in 17.58 seconds.
 Loss = 4.710042288388026
     0 examples learned
     50 examples learned
 Epoch 5 done in 22.71 seconds.
     0 examples learned
     50 examples learned
 Epoch 6 done in 17.32 seconds.
     0 examples learned
     50 examples learned
 Epoch 7 done in 17.47 seconds.
     0 examples learned
     50 examples learned
 Epoch 8 done in 17.68 seconds.
     0 examples learned
     50 examples learned
 Epoch 9 done in 17.53 seconds.
 Loss = 4.497564963056905
     0 examples learned
     50 examples learned
#+end_example

We can see that the loss is decreasing. However the time taken for each epoch (just 100 sentences)  is ~ 17 seconds. 
* Lets check predictions

#+begin_src lisp :results output :exports both
  (defun argmax (vector)
      (loop with h = (aref vector 0) 
	    with hi = 0 
	    for i from 1 below (length vector)
	    for v = (aref vector i) do 
	      (when (> v h)
		(setf h v
		      hi i))
	    finally (return hi)))

  (defun prediction (n x)
    (let ((p (forward-propagate n x)))
      (loop for pword across p 
	    for i from 0
	    with aword = nil do 
	      (if (< i (length x))
		  (setf aword (aref x i))
		  (setf aword nil))
	      (format t "~& ~s ~t~t~t ~s" (index-word aword)
		      (index-word (argmax pword))))))

  (prediction *network* (first (aref *data* 0)))
#+end_src

#+RESULTS:
#+begin_example
 ""     "``"
 "now"     ""
 "that"     ""
 "he"     "."
 "knew"     "."
 "himself"     "."
 "to"     "."
 "be"     "."
 "self"     "."
 "he"     "."
 "was"     "."
 "free"     "."
 "to"     "."
 "grok"     "."
 "ever"     "."
 "closer"     "."
 "to"     "."
 "his"     "."
 "brothers"     "."
 ","     "."
 ""     "."
 "without"     "."
 "let"     "."
 "."     ""
#+end_example

Unfortunately with just 9 epochs of learning, the RNN hasn't learnt anything yet. 
